Rspots/app/controllers/groups_controller.rb

  def edit
    id = params[:id]
    @group = Group.find_by_id(id)
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = 3 LIMIT 1

  def create
    group = params.require(:group).permit(:name, :lat, :lng)
    new_group = Group.create(group)
    GroupUser.create(group_id: new_group.id, user_id: @current_user.id, is_owner: true)
---
INSERT INTO "groups" ("created_at", "lat", "lng", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-23 19:04:02.740972"], ["lat", "-122.40542600000003"], ["lng", "37.796477"], ["name", "General Assembly"], ["updated_at", "2014-11-23 19:04:02.740972"]]
INSERT INTO "group_users" ("created_at", "group_id", "is_owner", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-23 19:04:02.759585"], ["group_id", 3], ["is_owner", "t"], ["updated_at", "2014-11-23 19:04:02.759585"], ["user_id", 4]]

  def update
    id = params[:id]
    @group = Group.find(id)
    if @group.update(group_params)
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = 9  [["name", "WDI2014"], ["updated_at", "2014-11-25 16:22:51.529263"]]

  def destroy
    id = params[:id]
    @group = Group.find(id)
    if @group.destroy
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 5]]

  def map
    id = params[:id]
    @group = Group.find_by_id(id) #will use to pass id into page for AJAX
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = 4 LIMIT 1