Rspots/app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "created_at", "lat", "lng", "phone_number", "place_id", "title", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "locations".* FROM "locations"  WHERE "locations"."place_id" = 'ChIJ62yCEWKAhYARNL0YQVpRuKg' LIMIT 1
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "group_locations".* FROM "group_locations"  WHERE "group_locations"."group_id" = 6 AND "group_locations"."location_id" = 7  ORDER BY "group_locations"."id" DESC LIMIT 1
INSERT INTO "group_locations" ("created_at", "group_id", "location_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-25 04:00:44.925559"], ["group_id", 6], ["location_id", 7], ["updated_at", "2014-11-25 04:00:44.925559"]]
INSERT INTO "reviews" ("created_at", "group_location_id", "rating", "review", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-25 04:00:44.953643"], ["group_location_id", 16], ["rating", 1], ["review", "great"], ["updated_at", "2014-11-25 04:00:44.953643"], ["user_id", 9]]
---
  def create
    group_id = params[:group_id]

    # add the location if it doesn't already exist
    location = location_params()
    new_location = Location.create_with(location).find_or_create_by(place_id: location[:place_id])
    new_location.groups << Group.find(group_id)
    new_location.save

    group_location = GroupLocation.where(group_id: group_id, location_id: new_location.id).last
    # binding.pry

    # add review that triggered location
    # add review that triggered location creation
    review = params.permit(:review, :rating )

    @new_review = Review.create(rating: review[:rating], review: review[:review], group_location_id: group_location.id, user_id: @current_user.id)

SELECT  "group_locations".* FROM "group_locations"  WHERE "group_locations"."group_id" = 5 AND "group_locations"."location_id" = 4 LIMIT 1
---
  def show
    g_id = params[:group_id]
    l_id = params[:id]
    @reviews = GroupLocation.find_by_group_id_and_location_id(g_id, l_id).reviews